zhelezyaka/lev-gen2-stm8s005k6/trunk/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
/********************************************************************************
* Include																		*
********************************************************************************/
#include "stm8s.h"
#include "Global_config.h"
#include "Module_Driver_Define.h"
#include "Module_Flash_Information.h"
#include "Module_Variable_Define.h"
#include "Module_Var_Bit_Define.h"

/********************************************************************************
* Define																		*
********************************************************************************/
#define INTO_HALT_MODE_DELAY_CYCLE  156     //10 sec = INTO_HALT_MODE_DELAY_CYCLE * TimerIntervalTimeBase_MS
/********************************************************************************
* Extern Function																*
********************************************************************************/


/********************************************************************************
* Extern Variable																*
********************************************************************************/

/********************************************************************************
* Global Variable																*
********************************************************************************/


//////////////////////////////////////////////////////////////////////////////
unsigned int FirstInitial_Func(){
	
	System_clk_setup();

    InitMosControl();
	InitLEDDisplay();

//    SetLed_DirectIO_OnOff(LED1, TurnOn);
//    SetLed_DirectIO_OnOff(LED2, TurnOn);
//    SetLed_DirectIO_OnOff(LED3, TurnOn);
//    SetLed_DirectIO_OnOff(LED4, TurnOn);
//    SetLed_DirectIO_OnOff(LED5, TurnOn);

	// Initialize LEDs
	
	//Setup_USI_Slave();
	
      delay_cycles(5);  //about 90us at 4MHz
      delay_cycles(10); //about 132us at 4MHz
      delay_cycles(20); //about 224us at 4MHz
      delay_cycles(30); //about 318us at 4MHz
      delay_cycles(40); //about 410us at 4MHz
      delay_cycles(50); //about 502us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
      delay_cycles(100); //about 960us at 4MHz
	
	
  return StartUp;
}


unsigned int Startup_Func()
{
  
	//Initialization
	disableInterrupts();  /* disable interrupts */

	
	G_Module_Status = 0;
    G_Auxiliary_Module_Status = 0;
	G_SystemFailureStatus = 0;
    G_LED_Interface_Status1 = 0;
    G_LED_Interface_Status2 = 0;
    G_Device_Interface_Status1 = 0;
    G_Add_Device_Interface_Status = 0;

 
    G_DSG_Current_ADC = 0;
    G_CHG_Current_ADC = 0;
    G_VBAT_ADC = 0;
    G_TH1_ADC = 0;
    G_TH2_ADC = 0;

	
	InitLEDDisplay();
    InitMosControl();
    InitButtonEvent();
    InitInputSignalPin();
    
    
    delay_cycles(5);
    InitAdapterOutputSignal();
    InitUARTFunction();
    
    /////////////////////////////////
    InitSubPollingProtectionVariables();
    InitADCFunction();
    Set_Interrupt_ADC_Conversion_Finish_Function(ProtectionForPolling); //wait for startAdcConversion()
    
    /////////////////////////////////
    InitTimerPollingVariables();
    //InitTimerFunction();
    InitAWUTimerFunction();
    

    
	enableInterrupts();  /* enable interrupts */
    
//    while(1){
//        SetLed_DirectIO_Pin_OnOff(LED2,1);
//        delay_cycles(100); //about 960us at 4MHz
//        SetLed_DirectIO_Pin_OnOff(LED2,0);
//        halt();
//        
//    }
//    while(1){
//    SetLedPWMFunction(0x1f, TurnOn);
//    
//    unsigned int i,j;
//    unsigned int loop_d = 150;
//    unsigned int ddelay = 100;
//    for(i = 0; i< loop_d; i++){
//        delay_cycles(ddelay);
//    }
//    
//    for(j=0; j< 20; j++){
//        SetLedPWM20Steps(j);
//        for(i = 0; i< loop_d; i++){
//            delay_cycles(ddelay);
//        }
//    }
//    
//    SetLedPWMFunction(0x00, TurnOff);
//    
//        for(i = 0; i< loop_d; i++){
//            delay_cycles(ddelay);
//        }
//    }

    
//unsigned char temp = 0;
//    if(temp == 0){
//        SetLed_DirectIO_OnOff(LED1, TurnOn);
//    }else{
//        SetLed_DirectIO_OnOff(LED1, TurnOff);
//    }
//    temp ^= 0x01;
    
    return NormalMode;
}

unsigned char inverse_led1_flag = 0;
unsigned char inverse_led2_flag = 0;

unsigned int Normal_Func(){
    
    //Set_Interrupt_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
    //Set_Interrupt_Timer_Calling_Function(2, startAdcConversion);       //64ms
    //G_Auxiliary_Module_Status &= ~Halt_Mode;
    
    Set_Interrupt_AWU_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
    Set_Interrupt_AWU_Timer_Calling_Function(2, startAdcConversion);       //64ms
    G_Auxiliary_Module_Status |= Halt_Mode;
    
    Set_Aux1_Counter_Cycles(INTO_HALT_MODE_DELAY_CYCLE);
    
    inverse_led1_flag = 0;
    inverse_led2_flag = 0;
    while(1){
        
        if(G_Device_Interface_Status1 & BUTTON_CLICK){
            G_Device_Interface_Status1 &= ~BUTTON_CLICK;
            
            ////////////////////////////////////////////////////////////
            // into normal wfi mode
            if(G_Auxiliary_Module_Status & Halt_Mode){
                DisableAWUTimerFunction();
                InitTimerFunction();
                Set_Interrupt_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
                Set_Interrupt_Timer_Calling_Function(2, startAdcConversion);       //64ms
                G_Auxiliary_Module_Status &= ~Halt_Mode;
                G_Add_Device_Interface_Status |= ENABLE_AUX1_COUNTER;
            }else{
                Reset_Aux1_Counter();
            }
            
            if(inverse_led1_flag == 0){
                SetLedPWMFunction(LED1+LED4+LED5, TurnOn);
                
                //SetLedLightOnFlag(LED1, TurnOn);
            }else{
                SetLedPWMFunction(LED1+LED4+LED5, TurnOff);
                //SetLedLightOnFlag(LED1, TurnOff);
            }
            inverse_led1_flag ^= 0x01;
        }
        
        if(G_Device_Interface_Status1 & BUTTON_LONG_PRESS){
            G_Device_Interface_Status1 &= ~BUTTON_LONG_PRESS;

