zhelezyaka/lev-gen2-stm8s005k6/trunk/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
            ////////////////////////////////////////////////////////////
            // into normal wfi mode
            if(G_Auxiliary_Module_Status & Halt_Mode){
                DisableAWUTimerFunction();
                InitTimerFunction();
                Set_Interrupt_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
                Set_Interrupt_Timer_Calling_Function(2, startAdcConversion);       //64ms
                G_Auxiliary_Module_Status &= ~Halt_Mode;
                G_Add_Device_Interface_Status |= ENABLE_AUX1_COUNTER;
            }else{
                Reset_Aux1_Counter();
            }

            
            if(inverse_led2_flag == 0){
                //SetLedLightOnFlag(LED2, TurnOn);
                SetLedSerialTurnOnOff(TurnOn);
            }else{
                //SetLedLightOnFlag(LED2, TurnOff);
                SetLedSerialTurnOnOff(TurnOff);
            }
            inverse_led2_flag ^= 0x01;
        }
        
        
        if(G_Auxiliary_Module_Status & SYS_1_SEC_FLAG){
            G_Auxiliary_Module_Status &= ~SYS_1_SEC_FLAG;
            UART_Send_Word_CRC(G_Var_Array, GVarArraySize, true);
        }
        
        
        ////////////////////////////////////////////////////////////
        // into Halt mode
        if(((G_Auxiliary_Module_Status & Halt_Mode)==0)&&(G_Add_Device_Interface_Status & AUX1_COUNTING_FINISH)){
            G_Add_Device_Interface_Status &= ~AUX1_COUNTING_FINISH;
            DisableTimerFunction();
            InitAWUTimerFunction();
            Set_Interrupt_AWU_Timer_Calling_Function(1, TimerCounterForPolling);   //64ms
            Set_Interrupt_AWU_Timer_Calling_Function(2, startAdcConversion);       //64ms
            G_Auxiliary_Module_Status |= Halt_Mode;
        }
        
        //delay_cycles(100); //about 960us at 4MHz
        if(G_Auxiliary_Module_Status & Halt_Mode){
            halt();
        }else{
            wfi();  /* Wait For Interrupt */
        }
        
        //SetLedPWMFunction(0x1f, TurnOn);
        //SetLed_DirectIO_OnOff(LED2, TurnOn);
        
//        SetLed_DirectIO_BITs(0xff);
//        //delay 1 sec
//        for(int i = 0; i < 200;i++){
//            delay_cycles(100); //about 960us at 4MHz
//        }
//        SetLed_DirectIO_BITs(0);
//        //delay 1 sec
//        for(int i = 0; i < 200;i++){
//            delay_cycles(100); //about 960us at 4MHz
//        }
        
        //wfi();
        
//        delay_cycles(5);  //about 90us at 4MHz
//        delay_cycles(10); //about 132us at 4MHz
//        delay_cycles(20); //about 224us at 4MHz
//        delay_cycles(30); //about 318us at 4MHz
//        delay_cycles(40); //about 410us at 4MHz
//        delay_cycles(50); //about 502us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        delay_cycles(100); //about 960us at 4MHz
//        for(int i = 0; i < 10;i++){
//            //delay_cycles(100); //about 960us at 4MHz
//        }        
    }//while(1);   
    return ShutdownMode;
}

unsigned int Shutdown_Func(){
    
    return StartUp;
}
#if 0
unsigned int Normal_Func(){
  //////////////////////////////////////////////////////////////////////////////
  // 2012/05/07 Remove DOC Propection, hsinmo
  //unsigned int DSG_OC_Delay_Count;
  unsigned int CHG_OC_Delay_Count;
  unsigned int _2ND_OV_Delay_Count;
  unsigned int _2ND_UV_Delay_Count;
  unsigned int iTemp1, iTemp2;
  
  //DSG_OC_Delay_Count = 0;
  CHG_OC_Delay_Count = 0;
  _2ND_OV_Delay_Count = 0;
  _2ND_UV_Delay_Count = 0;
  
  setMosFET(MOSFET_CHG, DeviceOn);
  setMosFET(MOSFET_DSG, DeviceOn);


  //Clear Activate Action Flag
  G_Activate_Action_Status = 0;
  G_Activate_Action_Status_Other1  = 0;
  //G_CHG_CV_MODE_Cycle_Count = 0;
  //G_DSG_CHG_OC_Delay_Count = 0;
  
  //Coulomb Counter Start
  G_Activate_Action_Status |= ACCUMULATING_Q_ENABLE;
  
  while(1){

    
    __delay_cycles(3000);  // 3ms ==> 1MHz clock
    StartAdcConversion();
    
    ///////////////////////////////////////
    // Current Detection
    iTemp1 = GetADCValue(ICHG_ADC);
    iTemp2 = GetADCValue(IDSG_ADC);
    if( iTemp1 >= ADC_DETECT_CURRENT_OF_CHG_STATUS){
      // in charging status
      G_Module_Status &= ~Module_DSG;
      G_Module_Status &= ~Module_RELAX;
    }else if( iTemp2 < ADC_DETECT_CURRENT_OF_DSG_STATUS ){
      // in relaxation mode or Quiescent current
      G_Module_Status |= Module_DSG;
      G_Module_Status |= Module_RELAX;
    }else{
      // in discharging
      G_Module_Status &= ~Module_RELAX;
      G_Module_Status |= Module_DSG;
    }
  
    
    if( iTemp1 >= ADC_COC_PROTECTION && ((G_Module_Status & Module_C_OC) == 0 )){
      CHG_OC_Delay_Count++;
      if(CHG_OC_Delay_Count >= OC_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_C_OC;
        //setBlinkLED(OC_BlinkLED, true);
      }
    }else{
      CHG_OC_Delay_Count = 0;
    }
//////////////////////////////////////////////////////////////////////////////
// 2012/05/07 Remove DOC Propection, hsinmo
//    if( iTemp2 >= ADC_DOC_PROTECTION && ((G_Module_Status & Module_D_OC) == 0 )){
//      G_DSG_CHG_OC_Delay_Count += (1 << 4);
//      if((G_DSG_CHG_OC_Delay_Count & 0xf0) >= (PROTECTION_DELAY_LOOP_COUNT << 4 )){
//        G_Module_Status |= Module_D_OC;
//        setBlinkLED(OC_BlinkLED, true);
//      }
//    }else{
//      G_DSG_CHG_OC_Delay_Count &= ~(0xf0);
//    }
    
    
    
    ///////////////////////////////////////
    //  Voltage control
    //Vbat Voltage check ==> 2nd level
    iTemp1 = GetADCValue(Vbat_ADC);
   
    if( iTemp1 > ADC_2ND_BATTERY_OV_PROTECTION &&
        (G_Module_Status & Module_2nd_OV) == 0)
    {
      _2ND_OV_Delay_Count++;
      if(_2ND_OV_Delay_Count >= OV_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_2nd_OV;
        //setBlinkLED(OV_UV_BlinkLED, true);
      }
    }else if( iTemp1 < ADC_2ND_BATTERY_UV_PROTECTION && 
        (G_Module_Status & Module_2nd_UV) == 0)
    {
      _2ND_UV_Delay_Count++;
      if(_2ND_UV_Delay_Count >= UV_PROTECTION_DELAY_LOOP_COUNT){
        G_Module_Status |= Module_2nd_UV;
        //setBlinkLED(OV_UV_BlinkLED, true);
      }
    }else{
      _2ND_UV_Delay_Count = 0;
      _2ND_OV_Delay_Count = 0;
    }
    
    //Cell OV/UV protection and release
    if(get_PIC_UVP_Status()){
      G_Module_Status |= Module_UV;
    }else{
      G_Module_Status &= ~Module_UV;
    }
    if(get_PIC_OVP_Status()){
      G_Module_Status |= Module_OV;
    }else{
      G_Module_Status &= ~Module_OV;
    }   
    

