zhelezyaka/lev-gen2-stm8s005k6/trunk/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
#if _SUSPEND_ENABLE_ > 0
    //into suspend mode
    if(G_Activate_Action_Status & SUSPEND_COUNTING_FINISH){
      //Coulomb Counter Stop
      G_Activate_Action_Status &= ~ACCUMULATING_Q_ENABLE;
      G_uc_SysModeStatusCode = Suspend_Func();
      //Coulomb Counter Start
      G_Activate_Action_Status |= ACCUMULATING_Q_ENABLE;
    }
#endif
    
    __delay_cycles(6000);  // 6ms ==> 1MHz clock
    if(G_uc_SysModeStatusCode != NormalMode){
      return G_uc_SysModeStatusCode;
    }

  } //while(1)
  
  return NormalMode;
  
}

unsigned int Failure_Func(){

  setMosFET(MOSFET_CHG, DeviceOff);
  setMosFET(MOSFET_DSG, DeviceOff);
  //setBlinkLED(LED_SET_ALL, false);
  __delay_cycles(1000);  // 1ms ==> 1MHz clock
  //setBlinkLED(SystemFailBlinkLED, true);
  
  G_Activate_Action_Status =0;
  G_Activate_Action_Status_Other1 = 0;
  while(1){
    if(G_uc_SysModeStatusCode != FailureMode){
      return G_uc_SysModeStatusCode;
    }
    if(G_Activate_Action_Status & BUTTON_LONG_PRESS_FLAG){
      G_Activate_Action_Status = 0;
      G_Activate_Action_Status_Other1 = 0;
      return ShutdownMode;
    }
  };
  
  return FailureMode;
}

unsigned int Shutdown_Func(){

  unsigned char icount;
  setMosFET(MOSFET_CHG, DeviceOff);
  setMosFET(MOSFET_DSG, DeviceOff);
  //setBlinkLED(LED_SET_ALL, false);
  __delay_cycles(1000);  // 1ms ==> 1MHz clock
  //BlinkLED(SystemFailBlinkLED, true);

#if _5LEDs_Thick_TYPE_ == 0
  unsigned char i,j, bit;
  bit = LED_PORT4;
  P2OUT |= ALL_LED_PORT;
  
  for(i=0; i<4; i++){
    for(j=0; j< 5;j++){
      __delay_cycles(100000);  // 100ms ==> 1MHz clock
    }
    P2OUT &= ~ALL_LED_PORT;
    P2OUT |= ALL_LED_PORT & (~bit);
    bit = (bit >> 1)  | LED_PORT4;
  }
  P2OUT &=~ALL_LED_PORT;
#endif
  
  G_Activate_Action_Status = 0;
  //G_Activate_Action_Status_Other1 = 0;
  while(1){
      TimerAStop();
      ///////////////////////////////////////////////////////
      // into Low Power Mode
      G_Activate_Action_Status_Other1 |= Low_Power_Mode;
      _BIS_SR(LPM3_bits);                       // Enter LPM3 w/interrupt
      ///////////////////////////////////////////////////////
      __delay_cycles(100); 
      InitTimerA();
      __delay_cycles(100000);  // 100ms ==> 1MHz clock
      icount = 0;
      while(1){
        if(G_uc_SysModeStatusCode != ShutdownMode){
          return G_uc_SysModeStatusCode;
        }
        if(G_Activate_Action_Status & BUTTON_LONG_PRESS_FLAG){
          G_Activate_Action_Status = 0;
          G_Activate_Action_Status_Other1 = 0;
          return StartUp;
        }
        if(icount > 200){
          icount = 0;
          break;
        }else{
          __delay_cycles(100000);  // 100ms ==> 1MHz clock
          icount++;
        }
      };    
    
  }//while(1){

  return StartUp;
}
unsigned int Calibration_Func(){

  setMosFET(MOSFET_CHG, DeviceOn);
  setMosFET(MOSFET_DSG, DeviceOn);
  //setBlinkLED(LED_SET_ALL, false);
  //DisplayLED(LED_SET_ALL, DeviceOn);
  G_Activate_Action_Status = 0;
  //G_Activate_Action_Status_Other1 = 0;


  __delay_cycles(10000);  // 10ms ==> 1MHz clock
  //BlinkLED(SystemFailBlinkLED, true);
  
  while(1){
    if(G_uc_SysModeStatusCode != CalibrationMode){
      break;
    }
    if(G_Activate_Action_Status & BUTTON_LONG_PRESS_FLAG){

      break;
    }
    __delay_cycles(10000);  // 10ms ==> 1MHz clock
    StartAdcConversion();

  };
  G_Activate_Action_Status = 0;
  G_Activate_Action_Status_Other1 = 0;
  setMosFET(MOSFET_CHG, DeviceOff);
  setMosFET(MOSFET_DSG, DeviceOff);
  return StartUp;
}

unsigned int Suspend_Func(){
  
  G_uc_SysModeStatusCode = SuspendMode;
  //setBlinkLED(LED2, true);
  
  

  while(1){
    setMosFET(MOSFET_CHG, DeviceOff);
    
    setMosFET(MOSFET_DSG, DeviceOff);
    ///////////////////////////////////////////////////////
    //解決 BUTTON_LONG_PRESS 進入 SuspendMode 時，
    // BUTTON_CLICK 無作用.
    G_Activate_Action_Status &= ~BUTTON_LONG_PRESS_FLAG;
    
    ///////////////////////////////////////////////////////
    //解決 進入 SuspendMode 時，無法跳到 CalibrationMode
    if(G_uc_SysModeStatusCode != SuspendMode){
      return CalibrationMode;
    }
    ///////////////////////////////////////////////////////
    // into Low Power Mode
    G_Activate_Action_Status |= ENABLE_SUSPEND_WAKE_UP_COUNTER;
    
    ///////////////////////////////////////////////////////
    G_Activate_Action_Status_Other1 |= Low_Power_Mode;
    _BIS_SR(LPM3_bits);                       // Enter LPM3 w/interrupt
    ///////////////////////////////////////////////////////

    
    __delay_cycles(10);
    if(G_Activate_Action_Status & SUSPEND_WAKE_UP_COUNTING_FINISH){
      G_Activate_Action_Status &= ~SUSPEND_WAKE_UP_COUNTING_FINISH;
      G_Activate_Action_Status &= ~ENABLE_SUSPEND_WAKE_UP_COUNTER;
    }
    setMosFET(MOSFET_CHG, DeviceOn);
    setMosFET(MOSFET_DSG, DeviceOn);
    //initial
    //InitAdcReader();
    __delay_cycles(100000);  // 100ms ==> 1MHz clock
    __delay_cycles(100000);  // 100ms ==> 1MHz clock
    if(G_Activate_Action_Status & (BUTTON_CLICK_FLAG + BUTTON_LONG_PRESS_FLAG)){
      //BUTTON_CLICK 離開susspend mode 並顯示 capacity
      //G_Activate_Action_Status &= ~BUTTON_CLICK_FLAG;
      break;
    }
    
    // Start ADC conversion
    StartAdcConversion();
    // get current
    if( GetADCValue(ICHG_ADC) >= ADC_DETECT_CURRENT_OF_CHG_STATUS || GetADCValue(IDSG_ADC) >= ADC_DETECT_CURRENT_OF_DSG_STATUS){
      //Wake-up and into Normal mode
      G_Activate_Action_Status &= ~SUSPEND_COUNTING_FINISH;
      G_Activate_Action_Status &= ~ENABLE_SUSPEND_COUNTER;
      break;
    }
//    //////////////////////////////////////////////
//    //for test 起來後會直接進入Normal
//      G_Activate_Action_Status &= ~SUSPEND_COUNTING_FINISH;
//      G_Activate_Action_Status &= ~ENABLE_SUSPEND_COUNTER;
//      break;
  }
  
  
  G_Activate_Action_Status = (G_Activate_Action_Status & (BUTTON_CLICK_FLAG + BUTTON_LONG_PRESS_FLAG)); //僅留button click 狀態
  G_Activate_Action_Status_Other1 = 0;
  
  return NormalMode;
}

