zhelezyaka/lev-gen2-stm8s005k6/trunk/ lev-gen2-stm8s005k6/src/LevG2_mainfun.c
  //_BIS_SR(LPM3_bits);                       // Enter LPM3 w/interrupt
  //__bic_SR_register_on_exit(LPM0_bits);  // Clear LPM0 bits from 0(SR) use in interrupt



//unsigned char Shipping_Func(){
//
//  setMosFET(MOSFET_CHG, DeviceOff);
//  setMosFET(MOSFET_DSG, DeviceOff);
//  setBlinkLED(LED_SET_ALL, false);
//  
//  __delay_cycles(1000);  // 1ms ==> 1MHz clock
//  
//  while(1){
//    
//    //ADC Stop
//    ADC10CTL0 &= ~(ADC10SHT_2 + MSC + ADC10ON + ADC10IE +SREF_1+REFON+REF2_5V);
//    setMosFET(MOSFET_CHG, DeviceOff);
//    // power off 
//    //SetMainPowerAction( DeviceOff );
//    __delay_cycles(10000);  // 10ms ==> 1MHz clock
//    
//    ///////////////////////////////////////////////////////
//    // into Low Power Mode
//    G_Activate_Action_Status |= ENABLE_WAKE_UP_COUNTER;
//    _BIS_SR(LPM3_bits);                       // Enter LPM3 w/interrupt
//    G_Activate_Action_Status &= ~WAKE_UP_COUNTING_FINISH;
//    WAKE_UP_Timer_Counter = 0;
//    // power on 
//    //SetMainPowerAction( DeviceOn );
//    __delay_cycles(10000);  // 10ms ==> 1MHz clock
//    //ADC on
//    ADC10CTL0 |= (ADC10SHT_2 + MSC + ADC10ON + ADC10IE +SREF_1+REFON+REF2_5V);
//    //detect charging adapter plugging-in
//    setMosFET(MOSFET_CHG, DeviceOn);
//    __delay_cycles(10000);  // 10ms ==> 1MHz clock
//    // Start ADC conversion
//    StartAdcConversion();
//    // get current
//    if( GetADCValue(ICHG_ADC) >= ADC_DETECT_CURRENT_OF_CHG_STATUS){
//      //Wake-up and into Normal mode
//      break;
//    }
//  }
//  return StartUp;
//}


#endif





